public class NumbersByWords {
    public String zero = "ноль";
    public String[] dig1 = {"один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"};
    public String[] dig10  = {"десять","одиннадцать", "двенадцать", "тринадцать", "четырнадцать",
            "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"};
    public String[] dig20  = {"двадцать", "тридцать", "сорок", "пятьдесят",
            "шестьдесят", "семьдесят", "восемьдесят", "девяносто"};
    public String[] dig100 = {"","сто","двести", "триста", "четыреста", "пятьсот",
            "шестьсот", "семьсот", "восемьсот", "девятьсот"};
    public String[] dig1000 = {"тысяч", "одна тысяча", "две тысячи", "три тысячи", "четыре тысячи", "пять тысяч", "шесть тысяч", "семь тысяч", "восемь тысяч", "девять тысяч"};
    public String million = "один миллион";

}
